backend: "vllm"
max_batch_size: 0

model_transaction_policy {
  decoupled: True
}

instance_group [
  {
    count: 1
    kind: KIND_MODEL
  }
]

input [
  { name: "text_input", data_type: TYPE_STRING, dims: [ 1 ] },
  { name: "stream", data_type: TYPE_BOOL, dims: [ 1 ] },
  { name: "sampling_parameters", data_type: TYPE_STRING, dims: [ 1 ] }
]

output [
  { name: "text_output", data_type: TYPE_STRING, dims: [ 1 ] }
]

parameters: {
  key: "REPORT_CUSTOM_METRICS"
  value: { string_value: "true" }
}
